# ConduitSize Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConduitSize Properties
ConduitSize Class See Also
---
The ConduitSize type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BendRadius | Minimum bend radius |
| InnerDiameter | Inner diameter |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| NominalDiameter | Nominal diameter |
| OuterDiameter | Outer diameter |
| UsedInSizeLists | Whether it is used in size lists. |
| UsedInSizing | Whether is used in sizing. |

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace